#+TITLE: XMonad Config
#+AUTHOR: Hai Nguyen
#+PROPERTY: header-args :tangle xmonad.hs
#+STARTUP: overview
* Variables
It's nice to assign values to stuff that you will use more than once in the config. Setting values for things like font, terminal and editor means you only have to change the value here to make changes globally.

#+BEGIN_SRC haskell
myFont :: String
myFont = "xft:SauceCodePro Nerd Font Mono:regular:size=15:antialias=true:hinting=true"

myModMask :: KeyMask
myModMask = mod4Mask        -- Sets modkey to super/windows key

myTerminal :: String
myTerminal = "alacritty"    -- Sets default terminal

myBrowser :: String
myBrowser = "qutebrowser"  -- Sets brave as browser

myEmacs :: String
myEmacs = "emacsclient -c -a 'emacs' "  -- Sets emacs as editor

myEditor :: String
myEditor = "emacsclient -c -a 'emacs' "  -- Sets emacs as editor
-- myEditor = myTerminal ++ " -e vim "    -- Sets vim as editor

myNote :: String;           -- Sets Handwritten Notetaking app
myNote = "write_stylus";

myEmail :: String;           -- Sets default email client
myEmail = "mailspring";

myBorderWidth :: Dimension
myBorderWidth = 2           -- Sets border width for windows

myNormColor :: String
myNormColor   = "#282c34"   -- Border color of normal windows

myFocusColor :: String
myFocusColor  = "#46d9ff"   -- Border color of focused windows

myFocusFollowsMouse :: Bool
myFocusFollowsMouse = False

mySearch :: String;
mySearch = "dmenu_run -i -nb '#0c0a20' -nf '#ff2afc' -sb '#ff2afc' -sf '#0c0a20' -fn 'NotoMonoRegular:pixelsize=25'"

myOffice :: String;
myOffice = "libreoffice";

myPass :: String;
myPass = "bitwarden-desktop";

windowCount :: X (Maybe String)
windowCount = gets $ Just . show . length . W.integrate' . W.stack . W.workspace . W.current . windowset
#+END_SRC

#+RESULTS:
#+begin_example
<interactive>:49:45-56: error:
    Not in scope: ‘W.integrate'’
    No module named ‘W’ is imported.

<interactive>:49:60-66: error:
    Not in scope: ‘W.stack’
    No module named ‘W’ is imported.

<interactive>:49:70-80: error:
    Not in scope: ‘W.workspace’
    No module named ‘W’ is imported.

<interactive>:49:84-92: error:
    Not in scope: ‘W.current’
    No module named ‘W’ is imported.
#+end_example

* Workspaces

#+begin_src haskell
-- myWorkspaces = [" 1 ", " 2 ", " 3 ", " 4 ", " 5 ", " 6 ", " 7 ", " 8 ", " 9 "]
myWorkspaces = ["dev", "sys", "note", "www", "doc", "mail", "chat", "media", "misc", "NSP"]
-- clickable ws = "<action=xdotool key super+"++show i++">"++ws++"</action>"
--     where i = fromJust $ M.lookup ws myWorkspaceIndices #+END_SRC

#+END_SRC
#+RESULTS:
: <interactive>:14:5-9: error: parse error on input ‘where’

** Workspaces
#+begin_src haskell

myWorkspaceKeys conf@(XConfig {XMonad.modMask = modMask}) = M.fromList $

  [((m .|. modMask, k), windows $ f i)

  --Keyboard layouts
  --qwerty users use this line
   | (i, k) <- zip (XMonad.workspaces conf) [xK_1,xK_2,xK_3,xK_4,xK_5,xK_6,xK_7,xK_8,xK_9,xK_0,xK_F13]

  --French Azerty users use this line
  -- | (i, k) <- zip (XMonad.workspaces conf) [xK_ampersand, xK_eacute, xK_quotedbl, xK_apostrophe, xK_parenleft, xK_minus, xK_egrave, xK_underscore, xK_ccedilla , xK_agrave]

  --Belgian Azerty users use this line
  -- | (i, k) <- zip (XMonad.workspaces conf) [xK_ampersand, xK_eacute, xK_quotedbl, xK_apostrophe, xK_parenleft, xK_section, xK_egrave, xK_exclam, xK_ccedilla, xK_agrave]

      , (f, m) <- [(W.greedyView, 0), (W.shift, shiftMask)
      , (\i -> W.greedyView i . W.shift i, shiftMask)]]

   ++
  -- ctrl-{w,e,r}, Switch to physical/Xinerama screens 1, 2, or 3
  -- ctrl-shift-{w,e,r}, Move client to screen 1, 2, or 3
  [((m .|. modMask, key), screenWorkspace sc >>= flip whenJust (windows . f))
      | (key, sc) <- zip [xK_w, xK_e] [0..]
      , (f, m) <- [(W.view, 0), (W.shift, shiftMask)]]
#+end_src

#+RESULTS:
: <interactive>:48:7: error: parse error on input ‘,’

